const mapCenter = [121.40003152077978, 31.152492021564836];
const mapZoom = 15;
const zoomToDisplayLabel = 15;
const districts = ['浦东新区','黄浦区','静安区','徐汇区','长宁区','虹口区','杨浦区','普陀区','闵行区','宝山区','嘉定区','金山区','松江区','青浦区','奉贤区','崇明区'];
// 闵行古美街道区域
const mhgmPoints = ['121.39241389005508, 31.132216640486455','121.40089389406927, 31.134565825251777','121.39794745199654, 31.14618724327117','121.40283423397084, 31.1476707250151','121.40642745601075, 31.150019523163248','121.40764915150432, 31.14612543102309','121.40973322028746, 31.142416621658082','121.41332644232737, 31.145012803597826','121.41763830877527, 31.147979780760934','121.41555423999212, 31.152924534305047','121.41142688238527, 31.16264454059467','121.40753432993613, 31.16110763231265','121.40804844063696, 31.15965491503754','121.40354385163918, 31.158454827279634','121.40244218585168, 31.161633973600157','121.41075088273135, 31.1642214194727','121.40915480878355, 31.168094995940333','121.40113897073469, 31.16534995826335','121.40227395665312, 31.16181179120905','121.39460811802951, 31.15976018516121','121.39380022978534, 31.16291823394902','121.3915234538245, 31.162623487226636','121.38861015985314, 31.16289718064242','121.38366490454038, 31.16348667144135','121.38564097214818, 31.159131704292296','121.38699438336481, 31.153148992207377','121.38745568503221, 31.14989577548822','121.38797117423616, 31.143134194618284','121.38817907322002, 31.1404245848964','121.38845069255491, 31.139613652668274','121.39004441689426, 31.136567171561197','121.3925678137649, 31.131997264593217',];
// 针对百度上的小区地址和实际地址不符的, 设置映射关系予以纠正.
const estateAliasMap = {
    // 鸿发家园
    '鸿发家园局部': '鸿发家园', // 三区用到。
    '鸿发家园（局部）': '鸿轩公寓', // 三区用到。没有小区区域数据。
    // 东方御花园
    '闵行区古美西路753弄': '东方御花园-北区', // 古美西路753弄5号
    '东方御花园局部': '东方御花园-北区', // 三区用到
    '东方御花园一期': '东方御花园-北区', // 三区用到
    '闵行区龙茗路513弄13支弄': '东方御花园-南区', // 闵行区龙茗路513弄13支弄
    '闵行区龙茗路513弄': '东方御花园-南区',
    '东方御花园（局部）': '东方御花园-南区', // 三区用到
    '东方御花园二期': '东方御花园-南区', // 三区用到
    // 春江锦庐
    '闵行区古美西路752弄': '春江锦庐', // 闵行区古美西路752号
    // 江南星城
    '闵行区顾戴路1199弄': '江南星城-纯翠江南', // 闵行区顾戴路1199弄龙茗路门
    '江南星城（一期）': '江南星城-纯翠江南', // 三区用到
    '闵行区顾戴路1325弄': '江南星城-叠翠江南', // 闵行区顾戴路1325弄1-123号
    '江南星城（二期）': '江南星城-叠翠江南', // 三区用到
    // 古美街道其他小区
    '平阳六街坊': '平阳绿家园', // 三区用到
    '闵行区虹莘路1601弄': '虹莘家园', // 闵行区虹莘路1601号
    '闵行区古龙路287弄': '新时代景庭', // 闵行区平吉路268号
    '闵行区虹梅路999弄': '华梅花苑',
    '闵行区虹莘路2288弄': '莲花新城',
    '平吉二村': '莲花新城', // 三区用到
    '闵行区虹莘路2448弄': '合成公寓',
    '闵行区龙茗路1458弄': '蓝色港湾',
    '闵行区古龙路1065弄': '新时代富嘉花园',
    '闵行区漕宝路1508弄': '东兰新村',
    '阳光美景城(西区)': '阳光美景城1期', // 三区用到
    '阳光美景城(东)': '阳光美景城-东区', // 三区用到
    // '阳光美景城(西区)': '阳光美景城-二期', // 三区用到
    '木兰苑':'东兰兴城木兰苑',
    '东兰路37弄':'东兰路37弄小区',
    '万源城E1街坊':'万源城-一期',
    '':'',
    // 大块区域修正
    '闵行区七宝村（七宝村散区）': '', // 对应很大一块区域。屏蔽。
};
/*
防范区：以下居民小区、自然村，近14天内无阳性感染者报告，被划分为“防范区”。rgb(0, 209, 0)   #6bdab4
管控区：以下居民小区、自然村，近7天内无阳性感染者报告，被划分为“管控区”。rgb(255, 169, 0)  #fdc368
封控区：以下居民小区、自然村，近7天内有阳性感染者报告，被划分为“封控区”。rgb(255, 41, 65)  #e47d7e
 */
const iconType0 = new BMapGL.Icon('images/ic_release.svg', new BMapGL.Size(16, 16));
const iconType1 = new BMapGL.Icon('images/ic_protection.svg', new BMapGL.Size(16, 16));
const iconType2 = new BMapGL.Icon('images/ic_locked.svg', new BMapGL.Size(16, 16));
const color0 = '#6bdab4';
const color1 = '#fdc368';
const color2 = '#e47d7e';
const regionPolygonOptions0 = {strokeWeight: 1, fillColor: color0, fillOpacity: 1};
const regionPolygonOptions1 = {strokeWeight: 1, fillColor: color1, fillOpacity: 1};
const regionPolygonOptions2 = {strokeWeight: 1, fillColor: color2, fillOpacity: 1};

const covidIcon = new BMapGL.Icon('images/covid.svg', new BMapGL.Size(15, 15));
const unblockIcon = new BMapGL.Icon('images/smile.png', new BMapGL.Size(15, 15));
const defaultLabelStyle = {textAlign: 'center'};
const unblockLabelStyle = {border: 0, textAlign: 'center', background: 'transparent'};
const districtPolygonOptions = {strokeWeight: 1, fillColor: 'blue', fillOpacity: 0.02};
const regionPolygonOptions = {strokeWeight: 1, fillColor: 'blue', fillOpacity: 0.05};
const estatePolygonOptions = {
    strokeWeight: 1,
    strokeOpacity: 0.5,
    fillColor: '#e47d7e',
    fillOpacity: 1
};
